---
kind: type
id: T:Autodesk.Revit.DB.ModelCurveArrayIterator
source: html/d8180cb2-4880-7886-32e2-062342b7491e.htm
---
# Autodesk.Revit.DB.ModelCurveArrayIterator

An iterator to a model curve array.

## Syntax (C#)
```csharp
public abstract class ModelCurveArrayIterator : APIObject,
	IEnumerator
```